vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "ahmadawais.shades-of-purple"
vscode "albert.tabout"
vscode "alefragnani.bookmarks"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "andrewbrey.rust-test-highlight"
vscode "anthropic.claude-code"
vscode "arthurlobo.easy-codesnap"
vscode "astral-sh.ty"
vscode "barbosshack.crates-io"
vscode "biomejs.biome"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "chakrounanas.turbo-console-log"
vscode "charliermarsh.ruff"
vscode "clnhlzmn.mathpadpp"
vscode "codeandstuff.package-json-upgrade"
vscode "csharpier.csharpier-vscode"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dekirisu.dekirisu-rust-themes"
vscode "detachhead.basedpyright"
vscode "docker.docker"
vscode "dracula-theme.theme-dracula"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "edwinhuish.better-comments-next"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "galloween.jsdoc-highlight-code"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "graphite.gti-vscode"
vscode "gregoire.dance"
vscode "gregoire.dance-helix"
vscode "gregoire.tree-sitter"
vscode "hbenl.vscode-test-explorer"
vscode "iceworks-team.iceworks-style-helper"
vscode "icrawl.discord-vscode"
vscode "irongeek.vscode-env"
vscode "janisdd.vscode-edit-csv"
vscode "jedeop.crates-completer"
vscode "jetmartin.bats"
vscode "johnpapa.vscode-peacock"
vscode "kevinrose.line-link"
vscode "kevinrose.vsc-python-indent"
vscode "lea21st.vscode-sql-formatter"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mechatroner.rainbow-csv"
vscode "meganrogge.template-string-converter"
vscode "meta.pyrefly"
vscode "mgmcdermott.vscode-language-babel"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-speech"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-pg"
vscode "nicoespeon.abracadabra"
vscode "oderwat.indent-rainbow"
vscode "openai.chatgpt"
vscode "orta.vscode-jest"
vscode "oven.bun-vscode"
vscode "pamaron.pytest-runner"
vscode "patbenatar.advanced-new-file"
vscode "pflannery.vscode-versionlens"
vscode "planbcoding.vscode-react-refactor"
vscode "pmneo.tsimporter"
vscode "postman.postman-for-vscode"
vscode "redhat.vscode-yaml"
vscode "reflog.jsonresume"
vscode "rogalmic.bash-debug"
vscode "rust-lang.rust-analyzer"
vscode "sdras.night-owl"
vscode "shardulm94.trailing-spaces"
vscode "shaunlebron.vscode-parinfer"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sirtori.indenticator"
vscode "sjhuangx.vscode-scheme"
vscode "sleistner.vscode-fileutils"
vscode "snyk-security.snyk-vulnerability-scanner"
vscode "sourcegraph.amp"
vscode "sourcery.sourcery"
vscode "sst-dev.opencode"
vscode "streetsidesoftware.code-spell-checker"
vscode "stringham.move-ts"
vscode "stylelint.vscode-stylelint"
vscode "swiftlang.swift-vscode"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "twixes.pypi-assistant"
vscode "unional.vscode-sort-package-json"
vscode "usernamehw.errorlens"
vscode "valentjn.vscode-ltex"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wallabyjs.quokka-vscode"
vscode "wesbos.theme-cobalt2"
vscode "yoavbls.pretty-ts-errors"
vscode "zardoy.fix-all-json"
vscode "zardoy.ts-essential-plugins"
