tap "atlassian/acli"
tap "sst/tap"
tap "withgraphite/tap"
brew "atlassian/acli/acli"
brew "bat"
brew "bottom"
brew "cosign"
brew "difftastic"
brew "direnv"
brew "dust"
brew "exercism"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "fnm"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gnupg"
brew "grep"
brew "helix"
brew "jq"
brew "kanata"
brew "lazygit"
brew "postgresql@17", restart_service: :changed, link: true
brew "pinentry-mac"
brew "procs"
brew "pure"
brew "pyenv"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"
brew "rsync"
brew "sd"
brew "tmux"
brew "watch"
brew "withgraphite/tap/graphite"
brew "ykman"
brew "zellij"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "agent-browser"
brew "bash-language-server"
brew "cargo-nextest"
brew "just"
brew "markdownlint-cli2"
brew "taplo"
brew "typescript-language-server"
brew "uv"
brew "vscode-langservers-extracted"
brew "wasm-pack"
brew "wasm-tools"
brew "yaml-language-server"
cask "alacritty"
cask "alt-tab"
cask "brave-browser"
cask "claude"
cask "codex"
cask "discord"
cask "ghostty"
cask "granola"
cask "homerow"
cask "karabiner-elements"
cask "keycastr"
cask "monologue"
cask "notion"
cask "slack"
cask "zoom"
